In [1]:
import pandas as pd

In [2]:
data = {'company': ['A', 'B', 'C', 'C', 'B', 'B', 'A', 'D', 'D'],
       'year': [2019, 2018, 2018, 2019, 2019, 2020, 2018, 2018, 2019],
       'sales': [100, 89, 70, 85, 67, 110, 76, 56, 71],
       'profits': [11, 9, 4, 17, 20, -10, 7, 7, 18]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  company  year  sales  profits
0       A  2019    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2018     76        7
7       D  2018     56        7
8       D  2019     71       18

In [5]:
df['company']

0    A
1    B
2    C
3    C
4    B
5    B
6    A
7    D
8    D
Name: company, dtype: object

In [6]:
df['company'].unique()

array(['A', 'B', 'C', 'D'], dtype=object)

In [7]:
df['company'].value_counts()

B    3
A    2
C    2
D    2
Name: company, dtype: int64

In [8]:
df['year'].unique()

array([2019, 2018, 2020], dtype=int64)

In [9]:
df['year'].value_counts()

2019    4
2018    4
2020    1
Name: year, dtype: int64

In [10]:
# describe - desprictive stats

In [11]:
df

  company  year  sales  profits
0       A  2019    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2018     76        7
7       D  2018     56        7
8       D  2019     71       18

In [12]:
df.describe()

              year       sales    profits
count     9.000000    9.000000   9.000000
mean   2018.666667   80.444444   9.222222
std       0.707107   17.125355   9.107384
min    2018.000000   56.000000 -10.000000
25%    2018.000000   70.000000   7.000000
50%    2019.000000   76.000000   9.000000
75%    2019.000000   89.000000  17.000000
max    2020.000000  110.000000  20.000000

In [13]:
df['company']

0    A
1    B
2    C
3    C
4    B
5    B
6    A
7    D
8    D
Name: company, dtype: object

In [14]:
df.describe(include=object)

       company
count        9
unique       4
top          B
freq         3

In [15]:
df['year']

0    2019
1    2018
2    2018
3    2019
4    2019
5    2020
6    2018
7    2018
8    2019
Name: year, dtype: int64

In [16]:
df['year'].astype(object)

0    2019
1    2018
2    2018
3    2019
4    2019
5    2020
6    2018
7    2018
8    2019
Name: year, dtype: object

In [17]:
df['year'] = df['year'].astype(object)

In [18]:
df

  company  year  sales  profits
0       A  2019    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2018     76        7
7       D  2018     56        7
8       D  2019     71       18

In [19]:
df.describe()

            sales    profits
count    9.000000   9.000000
mean    80.444444   9.222222
std     17.125355   9.107384
min     56.000000 -10.000000
25%     70.000000   7.000000
50%     76.000000   9.000000
75%     89.000000  17.000000
max    110.000000  20.000000

In [20]:
df.describe(include=object)

       company  year
count        9     9
unique       4     3
top          B  2019
freq         3     4

In [21]:
# info()

In [22]:
df

  company  year  sales  profits
0       A  2019    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2018     76        7
7       D  2018     56        7
8       D  2019     71       18

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   company  9 non-null      object
 1   year     9 non-null      object
 2   sales    9 non-null      int64
 3   profits  9 non-null      int64
dtypes: int64(2), object(2)
memory usage: 420.0+ bytes

In [24]:
df

  company  year  sales  profits
0       A  2019    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2018     76        7
7       D  2018     56        7
8       D  2019     71       18

In [26]:
# Fetching values from dataframe

In [27]:
# Fetch all rows for company B

In [28]:
df['company'] == 'B'

0    False
1     True
2    False
3    False
4     True
5     True
6    False
7    False
8    False
Name: company, dtype: bool

In [29]:
df[df['company'] == 'B']

  company  year  sales  profits
1       B  2018     89        9
4       B  2019     67       20
5       B  2020    110      -10

In [30]:
# Fetch the data for year 2018

In [31]:
df[df['year'] == 2018]

  company  year  sales  profits
1       B  2018     89        9
2       C  2018     70        4
6       A  2018     76        7
7       D  2018     56        7

In [32]:
# fetch the rows which has sales more than the mean sales

In [33]:
df['sales'].mean()

80.44444444444444

In [34]:
df['sales'] > df['sales'].mean()

0     True
1     True
2    False
3     True
4    False
5     True
6    False
7    False
8    False
Name: sales, dtype: bool

In [35]:
df[df['sales'] > df['sales'].mean()]

  company  year  sales  profits
0       A  2019    100       11
1       B  2018     89        9
3       C  2019     85       17
5       B  2020    110      -10

In [36]:
# Fetch the rows for which the profit is negative

In [37]:
df[df['profits'] < 0]

  company  year  sales  profits
5       B  2020    110      -10

In [38]:
# query()

In [39]:
df

  company  year  sales  profits
0       A  2019    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2018     76        7
7       D  2018     56        7
8       D  2019     71       18

In [40]:
df.query("company == 'B'")

  company  year  sales  profits
1       B  2018     89        9
4       B  2019     67       20
5       B  2020    110      -10

In [41]:
df.query("year == 2018")

  company  year  sales  profits
1       B  2018     89        9
2       C  2018     70        4
6       A  2018     76        7
7       D  2018     56        7

In [42]:
df.query("sales > df['sales'].mean()")

UndefinedVariableError: name 'df' is not defined

In [43]:
df.query(f"sales > {df['sales'].mean()}")

  company  year  sales  profits
0       A  2019    100       11
1       B  2018     89        9
3       C  2019     85       17
5       B  2020    110      -10

In [44]:
df.query("profits < 0")

  company  year  sales  profits
5       B  2020    110      -10

In [45]:
help(df.query)

Help on method query in module pandas.core.frame:

query(expr: 'str', *, inplace: 'bool' = False, **kwargs) -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Query the columns of a DataFrame with a boolean expression.

    Parameters
    ----------
    expr : str
        The query string to evaluate.

        You can refer to variables
        in the environment by prefixing them with an '@' character like
        ``@a + b``.

        You can refer to column names that are not valid Python variable names
        by surrounding them in backticks. Thus, column names containing spaces
        or punctuations (besides underscores) or starting with digits must be
        surrounded by backticks. (For example, a column named "Area (cm^2)" would
        be referenced as ```Area (cm^2)```). Column names which are Python keywords
        (like "list", "for", "import", etc) cannot be used.

        For example, if one of your columns is called ``a a`` and you want
        to sum it with ``b``, your query should be ```a a` + b``.

        .. versionadded:: 0.25.0
            Backtick quoting introduced.

        .. versionadded:: 1.0.0
            Expanding functionality of backtick quoting for more than only spaces.

    inplace : bool
        Whether to modify the DataFrame rather than creating a new one.
    **kwargs
        See the documentation for :func:`eval` for complete details
        on the keyword arguments accepted by :meth:`DataFrame.query`.

    Returns
    -------
    DataFrame or None
        DataFrame resulting from the provided query expression or
        None if ``inplace=True``.

    See Also
    --------
    eval : Evaluate a string describing operations on
        DataFrame columns.
    DataFrame.eval : Evaluate a string describing operations on
        DataFrame columns.

    Notes
    -----
    The result of the evaluation of this expression is first passed to
    :attr:`DataFrame.loc` and if that fails because of a
    multidimensional key (e.g., a DataFrame) then the result will be passed
    to :meth:`DataFrame.__getitem__`.

    This method uses the top-level :func:`eval` function to
    evaluate the passed query.

    The :meth:`~pandas.DataFrame.query` method uses a slightly
    modified Python syntax by default. For example, the ``&`` and ``|``
    (bitwise) operators have the precedence of their boolean cousins,
    :keyword:`and` and :keyword:`or`. This *is* syntactically valid Python,
    however the semantics are different.

    You can change the semantics of the expression by passing the keyword
    argument ``parser='python'``. This enforces the same semantics as
    evaluation in Python space. Likewise, you can pass ``engine='python'``
    to evaluate an expression using Python itself as a backend. This is not
    recommended as it is inefficient compared to using ``numexpr`` as the
    engine.

    The :attr:`DataFrame.index` and
    :attr:`DataFrame.columns` attributes of the
    :class:`~pandas.DataFrame` instance are placed in the query namespace
    by default, which allows you to treat both the index and columns of the
    frame as a column in the frame.
    The identifier ``index`` is used for the frame index; you can also
    use the name of the index to identify it in a query. Please note that
    Python keywords may not be used as identifiers.

    For further details and examples see the ``query`` documentation in
    :ref:`indexing <indexing.query>`.

    *Backtick quoted variables*

    Backtick quoted variables are parsed as literal Python code and
    are converted internally to a Python valid identifier.
    This can lead to the following problems.

    During parsing a number of disallowed characters inside the backtick
    quoted string are replaced by strings that are allowed as a Python identifier.
    These characters include all operators in Python, the space character, the
    question mark, the exclamation mark, the dollar sign, and the euro sign.
    For other characters that fall outside the ASCII range (U+0001..U+007F)
    and those that are not further specified in PEP 3131,
    the query parser will raise an error.
    This excludes whitespace different than the space character,
    but also the hashtag (as it is used for comments) and the backtick
    itself (backtick can also not be escaped).

    In a special case, quotes that make a pair around a backtick can
    confuse the parser.
    For example, ```it's` > `that's``` will raise an error,
    as it forms a quoted string (``'s > `that'``) with a backtick inside.

    See also the Python documentation about lexical analysis
    (https://docs.python.org/3/reference/lexical_analysis.html)
    in combination with the source code in :mod:`pandas.core.computation.parsing`.

    Examples
    --------
    >>> df = pd.DataFrame({'A': range(1, 6),
    ...                    'B': range(10, 0, -2),
    ...                    'C C': range(10, 5, -1)})
    >>> df
       A   B  C C
    0  1  10   10
    1  2   8    9
    2  3   6    8
    3  4   4    7
    4  5   2    6
    >>> df.query('A > B')
       A  B  C C
    4  5  2    6

    The previous expression is equivalent to

    >>> df[df.A > df.B]
       A  B  C C
    4  5  2    6

    For columns with spaces in their name, you can use backtick quoting.

    >>> df.query('B == `C C`')
       A   B  C C
    0  1  10   10

    The previous expression is equivalent to

    >>> df[df.B == df['C C']]
       A   B  C C
    0  1  10   10

In [46]:
df.query("profits < 0")

  company  year  sales  profits
5       B  2020    110      -10

In [47]:
df[df['profits'] < 0]

  company  year  sales  profits
5       B  2020    110      -10

In [48]:
# fetch the data/rows for year 2019 for company B

In [49]:
df[df['year'] == 2019 and df['company'] == 'B']

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [50]:
df[(df['year'] == 2019) and (df['company'] == 'B')]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [51]:
df[(df['year'] == 2019) & (df['company'] == 'B')]

  company  year  sales  profits
4       B  2019     67       20

In [52]:
df['year'] == 2019

0     True
1    False
2    False
3     True
4     True
5    False
6    False
7    False
8     True
Name: year, dtype: bool

In [53]:
df['company'] == 'B'

0    False
1     True
2    False
3    False
4     True
5     True
6    False
7    False
8    False
Name: company, dtype: bool

In [54]:
df.query("year == 2019 and company == 'B'")

  company  year  sales  profits
4       B  2019     67       20

In [55]:
# fetch the rows for company C and D

In [56]:
df[(df['company'] == 'C') & (df['company'] == 'D')]

Empty DataFrame
Columns: [company, year, sales, profits]
Index: []

In [57]:
df[(df['company'] == 'C') | (df['company'] == 'D')]

  company  year  sales  profits
2       C  2018     70        4
3       C  2019     85       17
7       D  2018     56        7
8       D  2019     71       18

In [58]:
df.query("company == 'C' or company == 'D'")

  company  year  sales  profits
2       C  2018     70        4
3       C  2019     85       17
7       D  2018     56        7
8       D  2019     71       18

In [59]:
df

  company  year  sales  profits
0       A  2019    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2018     76        7
7       D  2018     56        7
8       D  2019     71       18

In [60]:
# calculate the mean of profits column

In [61]:
df['profits'].mean()

9.222222222222221

In [62]:
# calculate the mean profit for company 'B'

In [64]:
df[df['company'] == 'B']

  company  year  sales  profits
1       B  2018     89        9
4       B  2019     67       20
5       B  2020    110      -10

In [65]:
df[df['company'] == 'B'].mean()

C:\Users\hp\AppData\Local\Temp\ipykernel_11260\3147996852.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df[df['company'] == 'B'].mean()

year       2019.000000
sales        88.666667
profits       6.333333
dtype: float64

In [66]:
df[df['company'] == 'B']['profits']

1     9
4    20
5   -10
Name: profits, dtype: int64

In [67]:
df[df['company'] == 'B']['profits'].mean()

6.333333333333333

In [68]:
# Find the mode of the company column

In [69]:
df

  company  year  sales  profits
0       A  2019    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2018     76        7
7       D  2018     56        7
8       D  2019     71       18

In [70]:
df['company'].mode()

0    B
Name: company, dtype: object

In [71]:
df['company'].mode().loc[0]

'B'

In [72]:
# Find the 25 percentile for the sales column

In [73]:
df

  company  year  sales  profits
0       A  2019    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2018     76        7
7       D  2018     56        7
8       D  2019     71       18

In [74]:
df['sales']

0    100
1     89
2     70
3     85
4     67
5    110
6     76
7     56
8     71
Name: sales, dtype: int64

In [75]:
# quantile

In [76]:
help(df['sales'].quantile)

Help on method quantile in module pandas.core.series:

quantile(q: 'float | Sequence[float] | AnyArrayLike' = 0.5, interpolation: 'QuantileInterpolation' = 'linear') -> 'float | Series' method of pandas.core.series.Series instance
    Return value at the given quantile.

    Parameters
    ----------
    q : float or array-like, default 0.5 (50% quantile)
        The quantile(s) to compute, which can lie in range: 0 <= q <= 1.
    interpolation : {'linear', 'lower', 'higher', 'midpoint', 'nearest'}
        This optional parameter specifies the interpolation method to use,
        when the desired quantile lies between two data points `i` and `j`:

            * linear: `i + (j - i) * fraction`, where `fraction` is the
              fractional part of the index surrounded by `i` and `j`.
            * lower: `i`.
            * higher: `j`.
            * nearest: `i` or `j` whichever is nearest.
            * midpoint: (`i` + `j`) / 2.

    Returns
    -------
    float or Series
        If ``q`` is an array, a Series will be returned where the
        index is ``q`` and the values are the quantiles, otherwise
        a float will be returned.

    See Also
    --------
    core.window.Rolling.quantile : Calculate the rolling quantile.
    numpy.percentile : Returns the q-th percentile(s) of the array elements.

    Examples
    --------
    >>> s = pd.Series([1, 2, 3, 4])
    >>> s.quantile(.5)
    2.5
    >>> s.quantile([.25, .5, .75])
    0.25    1.75
    0.50    2.50
    0.75    3.25
    dtype: float64

In [77]:
df['sales'].quantile(.25)

70.0

In [78]:
df['sales'].quantile(.9)

102.0

In [79]:
df['sales'].quantile(1)

110.0

In [80]:
df['sales'].max()

110

In [81]:
df['sales'].min()

56

In [82]:
df['sales'].quantile(0)

56.0

In [83]:
df['sales'].quantile(0.5)

76.0

In [84]:
df['sales'].median()

76.0

In [87]:
# Find the 25% quantile of profits for company 'B'

In [86]:
df[df['company']=='B']

  company  year  sales  profits
1       B  2018     89        9
4       B  2019     67       20
5       B  2020    110      -10

In [88]:
df[df['company']=='B']['profits']

1     9
4    20
5   -10
Name: profits, dtype: int64

In [89]:
df[df['company']=='B']['profits'].quantile(.25)

-0.5

In [90]:
df['sales'].std()

17.125354821952676

In [91]:
df['sales'].var()

293.2777777777778

In [93]:
df

  company  year  sales  profits
0       A  2019    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2018     76        7
7       D  2018     56        7
8       D  2019     71       18

In [92]:
# Pivot

In [94]:
df_pivot = df.pivot(index='company', columns='year', values='profits')

C:\Users\hp\AppData\Local\Temp\ipykernel_11260\3096133109.py:1: FutureWarning: In a future version, the Index constructor will not infer numeric dtypes when passed object-dtype sequences (matching Series behavior)
  df_pivot = df.pivot(index='company', columns='year', values='profits')

In [95]:
df_pivot

year     2018  2019  2020
company
A         7.0  11.0   NaN
B         9.0  20.0 -10.0
C         4.0  17.0   NaN
D         7.0  18.0   NaN

In [96]:
df_pivot.columns

Int64Index([2018, 2019, 2020], dtype='int64', name='year')

In [97]:
df_pivot.index

Index(['A', 'B', 'C', 'D'], dtype='object', name='company')

In [98]:
df.pivot(index='company', columns='year', values='sales')

C:\Users\hp\AppData\Local\Temp\ipykernel_11260\2413649381.py:1: FutureWarning: In a future version, the Index constructor will not infer numeric dtypes when passed object-dtype sequences (matching Series behavior)
  df.pivot(index='company', columns='year', values='sales')

year     2018   2019   2020
company
A        76.0  100.0    NaN
B        89.0   67.0  110.0
C        70.0   85.0    NaN
D        56.0   71.0    NaN

In [99]:
df.pivot(index='company', columns='year', values=['sales', 'profits'])

C:\Users\hp\AppData\Local\Temp\ipykernel_11260\3637585420.py:1: FutureWarning: In a future version, the Index constructor will not infer numeric dtypes when passed object-dtype sequences (matching Series behavior)
  df.pivot(index='company', columns='year', values=['sales', 'profits'])

        sales               profits
year     2018   2019   2020    2018  2019  2020
company
A        76.0  100.0    NaN     7.0  11.0   NaN
B        89.0   67.0  110.0     9.0  20.0 -10.0
C        70.0   85.0    NaN     4.0  17.0   NaN
D        56.0   71.0    NaN     7.0  18.0   NaN

In [100]:
df_pivot

year     2018  2019  2020
company
A         7.0  11.0   NaN
B         9.0  20.0 -10.0
C         4.0  17.0   NaN
D         7.0  18.0   NaN

In [101]:
df_pivot.loc['B']

year
2018     9.0
2019    20.0
2020   -10.0
Name: B, dtype: float64

In [102]:
df_pivot.loc['B'].mean()

6.333333333333333

In [103]:
df

  company  year  sales  profits
0       A  2019    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2018     76        7
7       D  2018     56        7
8       D  2019     71       18

In [104]:
df[df['company']=='B']['profits'].mean()

6.333333333333333

In [105]:
# pivot_table

In [106]:
df.pivot(index='company', columns='year', values='profits')

C:\Users\hp\AppData\Local\Temp\ipykernel_11260\332756829.py:1: FutureWarning: In a future version, the Index constructor will not infer numeric dtypes when passed object-dtype sequences (matching Series behavior)
  df.pivot(index='company', columns='year', values='profits')

year     2018  2019  2020
company
A         7.0  11.0   NaN
B         9.0  20.0 -10.0
C         4.0  17.0   NaN
D         7.0  18.0   NaN

In [107]:
df.pivot_table(index='company', columns='year', values='profits')

year     2018  2019  2020
company
A         7.0  11.0   NaN
B         9.0  20.0 -10.0
C         4.0  17.0   NaN
D         7.0  18.0   NaN

In [108]:
df.pivot_table(index='company', values='profits')

           profits
company
A         9.000000
B         6.333333
C        10.500000
D        12.500000

In [109]:
help(df.pivot_table)

Help on method pivot_table in module pandas.core.frame:

pivot_table(values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False, sort=True) -> 'DataFrame' method of pandas.core.frame.DataFrame instance
    Create a spreadsheet-style pivot table as a DataFrame.

    The levels in the pivot table will be stored in MultiIndex objects
    (hierarchical indexes) on the index and columns of the result DataFrame.

    Parameters
    ----------
    values : column to aggregate, optional
    index : column, Grouper, array, or list of the previous
        If an array is passed, it must be the same length as the data. The
        list can contain any of the other types (except list).
        Keys to group by on the pivot table index.  If an array is passed,
        it is being used as the same manner as column values.
    columns : column, Grouper, array, or list of the previous
        If an array is passed, it must be the same length as the data. The
        list can contain any of the other types (except list).
        Keys to group by on the pivot table column.  If an array is passed,
        it is being used as the same manner as column values.
    aggfunc : function, list of functions, dict, default numpy.mean
        If list of functions passed, the resulting pivot table will have
        hierarchical columns whose top level are the function names
        (inferred from the function objects themselves)
        If dict is passed, the key is column to aggregate and value
        is function or list of functions.
    fill_value : scalar, default None
        Value to replace missing values with (in the resulting pivot table,
        after aggregation).
    margins : bool, default False
        Add all row / columns (e.g. for subtotal / grand totals).
    dropna : bool, default True
        Do not include columns whose entries are all NaN. If True,
        rows with a NaN value in any column will be omitted before
        computing margins.
    margins_name : str, default 'All'
        Name of the row / column that will contain the totals
        when margins is True.
    observed : bool, default False
        This only applies if any of the groupers are Categoricals.
        If True: only show observed values for categorical groupers.
        If False: show all values for categorical groupers.

        .. versionchanged:: 0.25.0

    sort : bool, default True
        Specifies if the result should be sorted.

        .. versionadded:: 1.3.0

    Returns
    -------
    DataFrame
        An Excel style pivot table.

    See Also
    --------
    DataFrame.pivot : Pivot without aggregation that can handle
        non-numeric data.
    DataFrame.melt: Unpivot a DataFrame from wide to long format,
        optionally leaving identifiers set.
    wide_to_long : Wide panel to long format. Less flexible but more
        user-friendly than melt.

    Notes
    -----
    Reference :ref:`the user guide <reshaping.pivot>` for more examples.

    Examples
    --------
    >>> df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
    ...                          "bar", "bar", "bar", "bar"],
    ...                    "B": ["one", "one", "one", "two", "two",
    ...                          "one", "one", "two", "two"],
    ...                    "C": ["small", "large", "large", "small",
    ...                          "small", "large", "small", "small",
    ...                          "large"],
    ...                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
    ...                    "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
    >>> df
         A    B      C  D  E
    0  foo  one  small  1  2
    1  foo  one  large  2  4
    2  foo  one  large  2  5
    3  foo  two  small  3  5
    4  foo  two  small  3  6
    5  bar  one  large  4  6
    6  bar  one  small  5  8
    7  bar  two  small  6  9
    8  bar  two  large  7  9

    This first example aggregates values by taking the sum.

    >>> table = pd.pivot_table(df, values='D', index=['A', 'B'],
    ...                     columns=['C'], aggfunc=np.sum)
    >>> table
    C        large  small
    A   B
    bar one    4.0    5.0
        two    7.0    6.0
    foo one    4.0    1.0
        two    NaN    6.0

    We can also fill missing values using the `fill_value` parameter.

    >>> table = pd.pivot_table(df, values='D', index=['A', 'B'],
    ...                     columns=['C'], aggfunc=np.sum, fill_value=0)
    >>> table
    C        large  small
    A   B
    bar one      4      5
        two      7      6
    foo one      4      1
        two      0      6

    The next example aggregates by taking the mean across multiple columns.

    >>> table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
    ...                     aggfunc={'D': np.mean,
    ...                              'E': np.mean})
    >>> table
                    D         E
    A   C
    bar large  5.500000  7.500000
        small  5.500000  8.500000
    foo large  2.000000  4.500000
        small  2.333333  4.333333

    We can also calculate multiple types of aggregations for any given
    value column.

    >>> table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
    ...                     aggfunc={'D': np.mean,
    ...                              'E': [min, max, np.mean]})
    >>> table
                      D   E
                   mean max      mean  min
    A   C
    bar large  5.500000   9  7.500000    6
        small  5.500000   9  8.500000    8
    foo large  2.000000   5  4.500000    4
        small  2.333333   6  4.333333    2

In [110]:
df.pivot_table(index='year', values='profits')

      profits
year
2018     6.75
2019    16.50
2020   -10.00

In [111]:
df.pivot_table(index='company', values='profits', aggfunc='median')

         profits
company
A            9.0
B            9.0
C           10.5
D           12.5

In [113]:
df.pivot_table(index='company', values='profits', aggfunc='max')

         profits
company
A             11
B             20
C             17
D             18

In [114]:
df.pivot_table(index='company', values='profits', aggfunc='min')

         profits
company
A              7
B            -10
C              4
D              7

In [115]:
df.pivot_table(index='company', values='profits', aggfunc='mode')

AttributeError: 'mode' is not a valid function for 'DataFrameGroupBy' object

In [116]:
df.pivot_table(index='company', values='profits', aggfunc='quantile')

         profits
company
A            9.0
B            9.0
C           10.5
D           12.5

In [117]:
# Concatination

In [118]:
data1 = {'ids': [111, 222, 333, 444],
        'names': ['Alice', 'John', 'Dan', 'Jill'],
        'percents': [78.5, 91.0, 51.0, 83.5]}

In [119]:
df1 = pd.DataFrame(data1)

In [120]:
data2 = {'ids': [101, 102, 103],
        'names': ['Mark', 'Susan', 'Charlie'],
        'percents': [67.0, 78.5, 90.5]}

In [121]:
df2 = pd.DataFrame(data2)

In [122]:
df1

   ids  names  percents
0  111  Alice      78.5
1  222   John      91.0
2  333    Dan      51.0
3  444   Jill      83.5

In [123]:
df2

   ids    names  percents
0  101     Mark      67.0
1  102    Susan      78.5
2  103  Charlie      90.5

In [124]:
# concat

In [125]:
pd.concat([df1, df2])

   ids    names  percents
0  111    Alice      78.5
1  222     John      91.0
2  333      Dan      51.0
3  444     Jill      83.5
0  101     Mark      67.0
1  102    Susan      78.5
2  103  Charlie      90.5

In [126]:
pd.concat([df1, df2], axis=0)

   ids    names  percents
0  111    Alice      78.5
1  222     John      91.0
2  333      Dan      51.0
3  444     Jill      83.5
0  101     Mark      67.0
1  102    Susan      78.5
2  103  Charlie      90.5

In [127]:
pd.concat([df1, df2], axis=0, ignore_index=True)

   ids    names  percents
0  111    Alice      78.5
1  222     John      91.0
2  333      Dan      51.0
3  444     Jill      83.5
4  101     Mark      67.0
5  102    Susan      78.5
6  103  Charlie      90.5

In [128]:
pd.concat([df1, df2], axis=0, ignore_index=True, keys=['Batch1', 'Batch2'])

   ids    names  percents
0  111    Alice      78.5
1  222     John      91.0
2  333      Dan      51.0
3  444     Jill      83.5
4  101     Mark      67.0
5  102    Susan      78.5
6  103  Charlie      90.5

In [129]:
pd.concat([df1, df2], axis=0, keys=['Batch1', 'Batch2'])

          ids    names  percents
Batch1 0  111    Alice      78.5
       1  222     John      91.0
       2  333      Dan      51.0
       3  444     Jill      83.5
Batch2 0  101     Mark      67.0
       1  102    Susan      78.5
       2  103  Charlie      90.5

In [130]:
help(pd.concat)

Help on function concat in module pandas.core.reshape.concat:

concat(objs: 'Iterable[NDFrame] | Mapping[HashableT, NDFrame]', *, axis: 'Axis' = 0, join: 'str' = 'outer', ignore_index: 'bool' = False, keys=None, levels=None, names=None, verify_integrity: 'bool' = False, sort: 'bool' = False, copy: 'bool' = True) -> 'DataFrame | Series'
    Concatenate pandas objects along a particular axis.

    Allows optional set logic along the other axes.

    Can also add a layer of hierarchical indexing on the concatenation axis,
    which may be useful if the labels are the same (or overlapping) on
    the passed axis number.

    Parameters
    ----------
    objs : a sequence or mapping of Series or DataFrame objects
        If a mapping is passed, the sorted keys will be used as the `keys`
        argument, unless it is passed, in which case the values will be
        selected (see below). Any None objects will be dropped silently unless
        they are all None in which case a ValueError will be raised.
    axis : {0/'index', 1/'columns'}, default 0
        The axis to concatenate along.
    join : {'inner', 'outer'}, default 'outer'
        How to handle indexes on other axis (or axes).
    ignore_index : bool, default False
        If True, do not use the index values along the concatenation axis. The
        resulting axis will be labeled 0, ..., n - 1. This is useful if you are
        concatenating objects where the concatenation axis does not have
        meaningful indexing information. Note the index values on the other
        axes are still respected in the join.
    keys : sequence, default None
        If multiple levels passed, should contain tuples. Construct
        hierarchical index using the passed keys as the outermost level.
    levels : list of sequences, default None
        Specific levels (unique values) to use for constructing a
        MultiIndex. Otherwise they will be inferred from the keys.
    names : list, default None
        Names for the levels in the resulting hierarchical index.
    verify_integrity : bool, default False
        Check whether the new concatenated axis contains duplicates. This can
        be very expensive relative to the actual data concatenation.
    sort : bool, default False
        Sort non-concatenation axis if it is not already aligned when `join`
        is 'outer'.
        This has no effect when ``join='inner'``, which already preserves
        the order of the non-concatenation axis.

        .. versionchanged:: 1.0.0

           Changed to not sort by default.

    copy : bool, default True
        If False, do not copy data unnecessarily.

    Returns
    -------
    object, type of objs
        When concatenating all ``Series`` along the index (axis=0), a
        ``Series`` is returned. When ``objs`` contains at least one
        ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
        the columns (axis=1), a ``DataFrame`` is returned.

    See Also
    --------
    DataFrame.join : Join DataFrames using indexes.
    DataFrame.merge : Merge DataFrames by indexes or columns.

    Notes
    -----
    The keys, levels, and names arguments are all optional.

    A walkthrough of how this method fits in with other tools for combining
    pandas objects can be found `here
    <https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

    It is not recommended to build DataFrames by adding single rows in a
    for loop. Build a list of rows and make a DataFrame in a single concat.

    Examples
    --------
    Combine two ``Series``.

    >>> s1 = pd.Series(['a', 'b'])
    >>> s2 = pd.Series(['c', 'd'])
    >>> pd.concat([s1, s2])
    0    a
    1    b
    0    c
    1    d
    dtype: object

    Clear the existing index and reset it in the result
    by setting the ``ignore_index`` option to ``True``.

    >>> pd.concat([s1, s2], ignore_index=True)
    0    a
    1    b
    2    c
    3    d
    dtype: object

    Add a hierarchical index at the outermost level of
    the data with the ``keys`` option.

    >>> pd.concat([s1, s2], keys=['s1', 's2'])
    s1  0    a
        1    b
    s2  0    c
        1    d
    dtype: object

    Label the index keys you create with the ``names`` option.

    >>> pd.concat([s1, s2], keys=['s1', 's2'],
    ...           names=['Series name', 'Row ID'])
    Series name  Row ID
    s1           0         a
                 1         b
    s2           0         c
                 1         d
    dtype: object

    Combine two ``DataFrame`` objects with identical columns.

    >>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
    ...                    columns=['letter', 'number'])
    >>> df1
      letter  number
    0      a       1
    1      b       2
    >>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
    ...                    columns=['letter', 'number'])
    >>> df2
      letter  number
    0      c       3
    1      d       4
    >>> pd.concat([df1, df2])
      letter  number
    0      a       1
    1      b       2
    0      c       3
    1      d       4

    Combine ``DataFrame`` objects with overlapping columns
    and return everything. Columns outside the intersection will
    be filled with ``NaN`` values.

    >>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
    ...                    columns=['letter', 'number', 'animal'])
    >>> df3
      letter  number animal
    0      c       3    cat
    1      d       4    dog
    >>> pd.concat([df1, df3], sort=False)
      letter  number animal
    0      a       1    NaN
    1      b       2    NaN
    0      c       3    cat
    1      d       4    dog

    Combine ``DataFrame`` objects with overlapping columns
    and return only those that are shared by passing ``inner`` to
    the ``join`` keyword argument.

    >>> pd.concat([df1, df3], join="inner")
      letter  number
    0      a       1
    1      b       2
    0      c       3
    1      d       4

    Combine ``DataFrame`` objects horizontally along the x axis by
    passing in ``axis=1``.

    >>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
    ...                    columns=['animal', 'name'])
    >>> pd.concat([df1, df4], axis=1)
      letter  number  animal    name
    0      a       1    bird   polly
    1      b       2  monkey  george

    Prevent the result from including duplicate index values with the
    ``verify_integrity`` option.

    >>> df5 = pd.DataFrame([1], index=['a'])
    >>> df5
       0
    a  1
    >>> df6 = pd.DataFrame([2], index=['a'])
    >>> df6
       0
    a  2
    >>> pd.concat([df5, df6], verify_integrity=True)
    Traceback (most recent call last):
        ...
    ValueError: Indexes have overlapping values: ['a']

    Append a single row to the end of a ``DataFrame`` object.

    >>> df7 = pd.DataFrame({'a': 1, 'b': 2}, index=[0])
    >>> df7
        a   b
    0   1   2
    >>> new_row = pd.Series({'a': 3, 'b': 4})
    >>> new_row
    a    3
    b    4
    dtype: int64
    >>> pd.concat([df7, new_row.to_frame().T], ignore_index=True)
        a   b
    0   1   2
    1   3   4

In [131]:
pd.concat([df1, df2], axis=1, ignore_index=True)

     0      1     2      3        4     5
0  111  Alice  78.5  101.0     Mark  67.0
1  222   John  91.0  102.0    Susan  78.5
2  333    Dan  51.0  103.0  Charlie  90.5
3  444   Jill  83.5    NaN      NaN   NaN

In [132]:
pd.concat([df1, df2], axis=1)

   ids  names  percents    ids    names  percents
0  111  Alice      78.5  101.0     Mark      67.0
1  222   John      91.0  102.0    Susan      78.5
2  333    Dan      51.0  103.0  Charlie      90.5
3  444   Jill      83.5    NaN      NaN       NaN

In [133]:
data3 = {'grades': ['D', 'C', 'A'],
        'sports': ["yes", 'no', 'no']}

In [134]:
df3 = pd.DataFrame(data3)

In [135]:
df3

  grades sports
0      D    yes
1      C     no
2      A     no

In [136]:
df2

   ids    names  percents
0  101     Mark      67.0
1  102    Susan      78.5
2  103  Charlie      90.5

In [137]:
pd.concat([df2, df3], axis=1)

   ids    names  percents grades sports
0  101     Mark      67.0      D    yes
1  102    Susan      78.5      C     no
2  103  Charlie      90.5      A     no

In [138]:
# Handling missing data

In [139]:
df_shares = pd.read_excel('share_example_with_null.xlsx')

In [140]:
df_shares

        Date      A  B      C     D       E
0 2022-01-20   99.0  20  45.0  56.0  2000.0
1 2022-01-21   98.0  19   NaN  55.0  1993.0
2 2022-01-22   95.0  19  50.0  60.0     NaN
3 2022-01-23  101.0  22  56.0   NaN  1976.0
4 2022-01-24    NaN  22  55.0   NaN  2010.0

In [141]:
df_shares.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    5 non-null      datetime64[ns]
 1   A       4 non-null      float64
 2   B       5 non-null      int64
 3   C       4 non-null      float64
 4   D       3 non-null      float64
 5   E       4 non-null      float64
dtypes: datetime64[ns](1), float64(4), int64(1)
memory usage: 372.0 bytes

In [142]:
df_shares.isnull().sum()

Date    0
A       1
B       0
C       1
D       2
E       1
dtype: int64

In [143]:
df_shares

        Date      A  B      C     D       E
0 2022-01-20   99.0  20  45.0  56.0  2000.0
1 2022-01-21   98.0  19   NaN  55.0  1993.0
2 2022-01-22   95.0  19  50.0  60.0     NaN
3 2022-01-23  101.0  22  56.0   NaN  1976.0
4 2022-01-24    NaN  22  55.0   NaN  2010.0

In [144]:
df_shares['D']

0    56.0
1    55.0
2    60.0
3     NaN
4     NaN
Name: D, dtype: float64

In [145]:
df_shares['D'].mean()

57.0

In [146]:
df_shares

        Date      A  B      C     D       E
0 2022-01-20   99.0  20  45.0  56.0  2000.0
1 2022-01-21   98.0  19   NaN  55.0  1993.0
2 2022-01-22   95.0  19  50.0  60.0     NaN
3 2022-01-23  101.0  22  56.0   NaN  1976.0
4 2022-01-24    NaN  22  55.0   NaN  2010.0

In [148]:
df_shares['A'].mean()

98.25

In [149]:
df_shares['B'].mean()

KeyError: 'B'

In [150]:
df_shares.columns

Index(['Date', 'A', 'B ', 'C', 'D', 'E'], dtype='object')

In [151]:
df_shares['B '].mean()

20.4

In [152]:
# fillna()

In [153]:
# We fill the numerical cols with mean/median
# We fill the categorical cols with mode

In [154]:
df_shares

        Date      A  B      C     D       E
0 2022-01-20   99.0  20  45.0  56.0  2000.0
1 2022-01-21   98.0  19   NaN  55.0  1993.0
2 2022-01-22   95.0  19  50.0  60.0     NaN
3 2022-01-23  101.0  22  56.0   NaN  1976.0
4 2022-01-24    NaN  22  55.0   NaN  2010.0

In [156]:
df_shares.fillna({'A': df_shares['A'].mean(), 'C': df_shares['C'].mean(), 'D': df_shares['D'].mean()})

        Date       A  B      C     D       E
0 2022-01-20   99.00  20  45.0  56.0  2000.0
1 2022-01-21   98.00  19  51.5  55.0  1993.0
2 2022-01-22   95.00  19  50.0  60.0     NaN
3 2022-01-23  101.00  22  56.0  57.0  1976.0
4 2022-01-24   98.25  22  55.0  57.0  2010.0

In [157]:
df_shares

        Date      A  B      C     D       E
0 2022-01-20   99.0  20  45.0  56.0  2000.0
1 2022-01-21   98.0  19   NaN  55.0  1993.0
2 2022-01-22   95.0  19  50.0  60.0     NaN
3 2022-01-23  101.0  22  56.0   NaN  1976.0
4 2022-01-24    NaN  22  55.0   NaN  2010.0

In [158]:
df_shares.fillna({'A': df_shares['A'].mean(), 'C': df_shares['C'].mean(), 'D': df_shares['D'].mean()}, inplace=True)

In [159]:
df_shares

        Date       A  B      C     D       E
0 2022-01-20   99.00  20  45.0  56.0  2000.0
1 2022-01-21   98.00  19  51.5  55.0  1993.0
2 2022-01-22   95.00  19  50.0  60.0     NaN
3 2022-01-23  101.00  22  56.0  57.0  1976.0
4 2022-01-24   98.25  22  55.0  57.0  2010.0

In [160]:
# If any column has more than 40 % values missing, delete that column

In [161]:
# We refrain from deleting the rows

In [162]:
df_shares.isnull().sum()

Date    0
A       0
B       0
C       0
D       0
E       1
dtype: int64

In [164]:
df_shares.isnull().sum() / len(df) * 100

Date     0.000000
A        0.000000
B        0.000000
C        0.000000
D        0.000000
E       11.111111
dtype: float64

In [165]:
# Connecting the a database

In [166]:
# Sqlite3 DB
# Database name => my_db
# Table => COMPANY

In [167]:
import sqlite3

In [168]:
con = sqlite3.connect("E:/Work/db/sqlite-autoconf-3370200/my_db.db")

In [169]:
con

In [170]:
df = pd.read_sql_query("select * from COMPANY", con)

In [171]:
df

   ID   NAME  AGE     ADDRESS   SALARY
0   1   Paul   32  California  20000.0
1   2  Allen   25       Texas  15000.0
2   3  Teddy   23      Norway  20000.0
3   4   Mark   25  Rich-Mond   65000.0
4   5  David   27       Texas  85000.0
5   6    Kim   22  South-Hall  45000.0

In [172]:
con.close()